# Rebar Bend Data Crank Offset Length 1 Property

Source: https://www.revitapidocs.com/2026/4f39f5c4-8a69-79a5-aa28-114790b473f9.htm

---

| Rebar Bend Data Crank Offset Length 1 Property |
| --- |

Identifies the crank offset length at the end.

The default value is 0\. A positive value means that there is a valid crank. If the value is 0 it means that there is no crank. If the value is negative it means that there is a crank with incorrect values.

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double CrankOffsetLength1 { get; }
```

```
Public ReadOnly Property CrankOffsetLength1 As Double
	Get
```

```
public:
property double CrankOffsetLength1 {
	double get ();
}
```

```
member CrankOffsetLength1 : float with get
```

#### Property Value

Double See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace